Revit 2024 API
ScheduleDefinition.AddField Method
Overload List
Name | Description
AddField(SchedulableField)
 Adds a regular field at the end of the list.
AddField(ScheduleFieldType)
 Adds a regular field at the end of the list.
AddField(ScheduleFieldType, ElementId)
 Adds a regular field at the end of the list.
See Also
ScheduleDefinition Class
ScheduleDefinition Members
Autodesk.Revit.DB Namespace